results/2024-03-14/d59d3dfe-e232-11ee-af60-16ed30a120a1/CS-1710441845-query-the-title.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking elasticsearch.cs-perf-test.svc.cluster.local (be patient)...INFO: POST header == 
---
POST /so500k/_search HTTP/1.0
Content-length: 63
Content-type: application/json
Host: elasticsearch.cs-perf-test.svc.cluster.local:9200
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 164

{"took":16938,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":2,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":2,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":3,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":5,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":2,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":3,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":2,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":2,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":5,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":2,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":2,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":1,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
X-elastic-product: Elasticsearch
content-type: application/json
content-length: 160

{"took":0,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":{"value":0,"relation":"eq"},"max_score":null,"hits":[]}}
LOG: Response code = 200
..done


Server Software:        
Server Hostname:        elasticsearch.cs-perf-test.svc.cluster.local
Server Port:            9200

Document Path:          /so500k/_search
Document Length:        Variable

Concurrency Level:      10
Time taken for tests:   17.019 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      26604 bytes
Total body sent:        24700
HTML transferred:       16004 bytes
Requests per second:    5.88 [#/sec] (mean)
Time per request:       1701.869 [ms] (mean)
Time per request:       170.187 [ms] (mean, across all concurrent requests)
Transfer rate:          1.53 [Kbytes/sec] received
                        1.42 kb/s sent
                        2.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:     1  176 1693.4      6   16941
Waiting:        1  176 1693.4      5   16941
Total:          2  177 1693.6      6   16943

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      9
  75%     11
  80%     12
  90%     13
  95%     17
  98%     21
  99%  16943
 100%  16943 (longest request)